Revit 2027 API
PrintSetup.CurrentPrintSetting Property
The current Print Setting of Print Setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IPrintSetting CurrentPrintSetting { get; set; }
Public Property CurrentPrintSetting As IPrintSetting
	Get
	Set
public:
property IPrintSetting^ CurrentPrintSetting {
	IPrintSetting^ get ();
	void set (IPrintSetting^ value);
}
member CurrentPrintSetting : IPrintSetting with get, set
Property Value
IPrintSetting
See Also
Reference
PrintSetup Class
Autodesk.Revit.DB Namespace